import pyecharts as p
#这些数据是经过excel处理的
city_name = ['朝阳市', '张掖市', '珠海市', '江门市', '韶关市', '高雄市',
       '茂名市', '汕头市', '海淀市', '东莞市', '宝山市','佛山市',
      '芜湖市', '台州市','潮州市', '柳州市', '惠州市', '汕尾市',
      '湛江市', '开封市', '长沙市', '清远市', '阳江市', '驻马店市',
      '揭阳市', '阜阳市', '泉州市', '中山市', '肇庆市',
      '花莲县', '云浮市', '黔江市', '河源市', '广州市', '深圳市',
       '梅州市', '江北市']
num = [1,1,5,7,2,1,6,19,1,12,1,16,1,1,10,1,2,2,7,2,1,2,7,1,
      10,1,2,8,1,1,2,1,1,164,12,9,1]

cc = p.Map('我的微信好友',width=1200,height=600)
cc.add('',city_name,num,maptype='广东',is_visualmap=True,visual_text_color='#000')
cc.render()


